---
kind: property
id: P:Autodesk.Revit.DB.Category.LineColor
source: html/0f3d0161-ecd8-111b-418f-8abe9cbc19da.htm
---
# Autodesk.Revit.DB.Category.LineColor Property

The color of lines shown for elements of this category.

## Syntax (C#)
```csharp
public Color LineColor { get; set; }
```